app/views/users/index.html.erb

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 6]]
---
          <li>
            <small><%= pluralize(user.articles.count, "article") if user.articles %></small>