app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.user = User.first
    if @article.save
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)