app/controllers/users_controller.rb

UPDATE "users" SET "username" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "test5"], ["email", "test5@example.com"], ["password_digest", "$2a$10$lCdjEBy9RsfHBYvT8vOgouH9cuHnBnmnHgvQe4vwunQpWMLrmuy8y"], ["updated_at", "2019-01-04 11:00:36.972297"], ["id", 5]]
---
  def update

    if @user.update(user_params)

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 9]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 6]]
---
  def show
    @user_articles = @user.articles.paginate(page: params[:page], per_page: 5)